In [2]:
from pandas import DataFrame as df
import pandas as pd
import numpy as np

dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

df

                   A         B         C         D
2000-01-01  2.485481 -1.787381  1.139773  1.274207
2000-01-02 -0.474947  0.437549  1.002730 -0.093169
2000-01-03  0.784658 -1.574023  1.115447  0.634430
2000-01-04 -0.413151 -1.219965 -1.475556  0.551656
2000-01-05  0.948775 -1.222494  0.195447 -0.059991
2000-01-06 -1.202440 -0.625163  0.137067 -0.439236
2000-01-07  1.347141  1.078430  0.269089 -0.652674
2000-01-08 -0.934136 -0.732612  1.224277  1.037962

In [3]:
print(df.index)
print(df.index[0],type(df.index[0]))

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')
2000-01-01 00:00:00 <class 'pandas._libs.tslib.Timestamp'>

In [4]:
df.iloc[0]

A    2.485481
B   -1.787381
C    1.139773
D    1.274207
Name: 2000-01-01 00:00:00, dtype: float64

In [5]:
print(df.index[0].date())
print(df.index[0].to_pydatetime(),type(df.index[0].to_pydatetime()))
print(df.loc[df.index[0]])

2000-01-01
2000-01-01 00:00:00 <class 'datetime.datetime'>
A    2.485481
B   -1.787381
C    1.139773
D    1.274207
Name: 2000-01-01 00:00:00, dtype: float64

In [6]:
from datetime import datetime as dt
weekday = dt.strptime('2017-9-3','%Y-%m-%d').weekday()
weekday

6

In [7]:
df.loc[df.index[0]]

A    2.485481
B   -1.787381
C    1.139773
D    1.274207
Name: 2000-01-01 00:00:00, dtype: float64

In [8]:
print(type(df.columns))
df.columns

<class 'pandas.core.indexes.base.Index'>

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
dt = {id:dict(df.loc[id]) for id in df.index}
dt

{Timestamp('2000-01-01 00:00:00', freq='D'): {'A': 2.4854805407252329,
  'B': -1.7873812049204867,
  'C': 1.1397731786226484,
  'D': 1.2742071783793902},
 Timestamp('2000-01-02 00:00:00', freq='D'): {'A': -0.47494742547931629,
  'B': 0.43754930407214937,
  'C': 1.0027300391410361,
  'D': -0.093169277387548557},
 Timestamp('2000-01-03 00:00:00', freq='D'): {'A': 0.78465768630668897,
  'B': -1.5740234002503397,
  'C': 1.1154472485570477,
  'D': 0.63443027648730022},
 Timestamp('2000-01-04 00:00:00', freq='D'): {'A': -0.4131509391355862,
  'B': -1.21996514784082,
  'C': -1.475556276305394,
  'D': 0.55165564266429401},
 Timestamp('2000-01-05 00:00:00', freq='D'): {'A': 0.94877482043135408,
  'B': -1.2224938060504109,
  'C': 0.19544663900410617,
  'D': -0.059990981629548856},
 Timestamp('2000-01-06 00:00:00', freq='D'): {'A': -1.2024399817862808,
  'B': -0.62516318330885368,
  'C': 0.13706665777517707,
  'D': -0.43923622407645574},
 Timestamp('2000-01-07 00:00:00', freq='D'): {'A': 1.3471406103207337,
  'B': 1.0784300490976353,
  'C': 0.26908900822036935,
  'D': -0.6526736679534535},
 Timestamp('2000-01-08 00:00:00', freq='D'): {'A': -0.93413623007997659,
  'B': -0.73261241737768412,
  'C': 1.2242765208721373,
  'D': 1.0379624233624216}}

In [10]:
dict(df)

{'A': 2000-01-01    2.485481
 2000-01-02   -0.474947
 2000-01-03    0.784658
 2000-01-04   -0.413151
 2000-01-05    0.948775
 2000-01-06   -1.202440
 2000-01-07    1.347141
 2000-01-08   -0.934136
 Freq: D, Name: A, dtype: float64, 'B': 2000-01-01   -1.787381
 2000-01-02    0.437549
 2000-01-03   -1.574023
 2000-01-04   -1.219965
 2000-01-05   -1.222494
 2000-01-06   -0.625163
 2000-01-07    1.078430
 2000-01-08   -0.732612
 Freq: D, Name: B, dtype: float64, 'C': 2000-01-01    1.139773
 2000-01-02    1.002730
 2000-01-03    1.115447
 2000-01-04   -1.475556
 2000-01-05    0.195447
 2000-01-06    0.137067
 2000-01-07    0.269089
 2000-01-08    1.224277
 Freq: D, Name: C, dtype: float64, 'D': 2000-01-01    1.274207
 2000-01-02   -0.093169
 2000-01-03    0.634430
 2000-01-04    0.551656
 2000-01-05   -0.059991
 2000-01-06   -0.439236
 2000-01-07   -0.652674
 2000-01-08    1.037962
 Freq: D, Name: D, dtype: float64}

In [11]:
df.rename(columns={'A':'newA'},inplace = True)
df

                newA         B         C         D
2000-01-01  2.485481 -1.787381  1.139773  1.274207
2000-01-02 -0.474947  0.437549  1.002730 -0.093169
2000-01-03  0.784658 -1.574023  1.115447  0.634430
2000-01-04 -0.413151 -1.219965 -1.475556  0.551656
2000-01-05  0.948775 -1.222494  0.195447 -0.059991
2000-01-06 -1.202440 -0.625163  0.137067 -0.439236
2000-01-07  1.347141  1.078430  0.269089 -0.652674
2000-01-08 -0.934136 -0.732612  1.224277  1.037962

In [12]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7'],
                    'E': ['E4', 'E5', 'E6', 'E7']},
                    index=[0, 1, 2, 3]) 

frames = [df1, df2]
dfm_new = pd.concat(frames)
dfm_new

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
1  A1  B1  C1  D1  NaN
2  A2  B2  C2  D2  NaN
3  A3  B3  C3  D3  NaN
0  A4  B4  C4  D4   E4
1  A5  B5  C5  D5   E5
2  A6  B6  C6  D6   E6
3  A7  B7  C7  D7   E7

In [13]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [14]:
df2

    A   B   C   D   E
0  A4  B4  C4  D4  E4
1  A5  B5  C5  D5  E5
2  A6  B6  C6  D6  E6
3  A7  B7  C7  D7  E7

In [15]:
dfm_new.loc[0]

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
0  A4  B4  C4  D4   E4

In [16]:
dfm_new2 = pd.concat(frames,ignore_index=True)
dfm_new2

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
1  A1  B1  C1  D1  NaN
2  A2  B2  C2  D2  NaN
3  A3  B3  C3  D3  NaN
4  A4  B4  C4  D4   E4
5  A5  B5  C5  D5   E5
6  A6  B6  C6  D6   E6
7  A7  B7  C7  D7   E7

In [17]:
s1 = pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10', None]))
s1

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

In [18]:
s1[2]

NaT

In [19]:
type(s1[2])

pandas._libs.tslib.NaTType

In [20]:
pd.isnull(s1[2])

True

In [21]:
s1[2] ==pd.NaT

False

In [22]:
pd.isNaT(s1[2])

AttributeError: module 'pandas' has no attribute 'isNaT'

In [23]:
df1n = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 0, 2, 3])
print(df1n)

    A   B   C   D
0  A0  B0  C0  D0
0  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df1n.loc[0]

    A   B   C   D
0  A0  B0  C0  D0
0  A1  B1  C1  D1

In [44]:
isinstance(df1n.loc[2],pd.Series)
df1n.loc[2]['A']

'A2'

In [28]:
from datetime import datetime
p1=pd.Timestamp(datetime.now())
print(p1)
p2=pd.Timestamp(datetime.now().date())
print(p2)

2017-09-26 11:45:29.404305
2017-09-26 00:00:00

In [29]:
df1n.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [33]:
df2n = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': [1, 2, 3, 4],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
print(df2n)

    A  B   C   D
0  A0  1  C0  D0
1  A1  2  C1  D1
2  A2  3  C2  D2
3  A3  4  C3  D3

In [35]:
ls_values =[]
for id in range(len(df2n)):
    ls_values.append([df2n.iloc[id][col] for col in df2n.columns])

print(ls_values)

[['A0', 1, 'C0', 'D0'], ['A1', 2, 'C1', 'D1'], ['A2', 3, 'C2', 'D2'], ['A3', 4, 'C3', 'D3']]